[{"title":"Performantly loading Google Fonts based on Data Saver","description":"Efficiently and Asynchronously load Google Fonts based on Data Saver mode","date":"5 June, 2020 10:30","id":"google-fonts-prefetch"},{"title":"(Part 1) Tech Stack & Design -  How I created my personal site","description":"In this post, I delve into the details of the design part of how I built my personal site with StencilJS and what did I use to do so.","date":"27 June, 2020 9:50","id":"how-i-created-personal-site-part-1"},{"title":"(Part 2) Blogging with Markdown -  How I created my personal site","description":"In this post, I delve into the details of how I built the blogging with markdown system","date":"28 June, 2020 9:50","id":"how-i-created-personal-site-part-2"},{"title":"(Part 3) Image Optimization Automation with Incremental builds - How I created my personal site","description":"In this post, I delve deep into how I automated image optimization on my blog.","date":"29 June, 2020 9:50","id":"how-i-created-personal-site-part-3"},{"title":"Safeguarding target=_blank links","description":"Do you know adding a link with target=_blank has the potential of crashing your page and is very insecure? Find out how and its prevention.","date":"9 June, 2020 8:41","id":"link-noopener"},{"title":"My First Blog post","description":"My very first blog post on my very first functional site","date":"31 May, 2020","id":"my-first-blog"},{"title":"Pitfalls when using Stencil Helmet during Prerendering","description":"Stencil Helmet can break the whole app really bad on some occasions, some so random that you might never find out why","date":"2 Jun, 2020 2:24","id":"pitfalls-stencil-helmet-prerendering"},{"title":"StencilJS Route Change events - Without any dependencies","description":"How to detect route changes in StencilJS Router using the core StencilJS APIs. No dependencies.","date":"3 June, 2020 01:46","id":"stencil-router-events"},{"title":"Web Workers: Intro and Basic Usage","description":"Have you ever heard this term \"Web Workers\" mentioned somewhere and wondered what the hell is this new thing? let me introduce you to this great tech.","date":"June 5, 2020 02:00","id":"web-workers-intro-basic-usage"}]